import pandas
illegal_organization = ['中国传统中医研究院促进会', '成都秋雨圣乐归正长老教会﹝（成都）秋雨之福归正教会﹞', '国家节能减碳产业创新联盟', 'WCCF文化慈善基金会', '成都宣传教会（成都宣传基督教会、基督教成都宣传教会）', '四川省政府采购协会（筹备组）', '上帝教会', '中国梦学习团体', '营山县退役军人联谊处', '耶和华见证人', '如星团契', '阆中教会', '安提阿教会', '以琳教会', '安州区环城绕佛团', '达州好土地布道所', '犍为县小雨滴助困爱心协会', '周坡镇文化人联谊会', '慈悲利他组织', '珍爱生命协会', '蓝色天空组织', '黑出租组织', '阿坝环保急救组织', '向东村湿地保护协会', '家乡和谐发展组织', '龙日坝青苗助学基金会', '安曲生态保护协会', '门徒会', '德阳市青草地归正长老会', '巴中橄榄山归正教会', '东望集团', '中国梦课堂', '东望集团课堂', '定军文化传播工作室', '石棉县义工义演志愿者服务队', '石棉县学雷锋志愿者服务队']

print(len(illegal_organization))

has_public_illegal_organization = ['中国传统中医研究院促进会', '四川省政府采购协会（筹备组）', '成都秋雨圣约归正长老教会﹝（成都）秋雨之福归正教会﹞', '国家节能减碳产业创新联盟', 'WCCF文化慈善基金会', '成都宣传教会（成都宣传基督教会、基督教成都宣传教会）', '北京市卫民安消防教育中心四川分中心', '与爱同行家庭教育联盟', '全国学校体育联盟', '成都市金牛区物流行业协会', '华夏民办教育联盟', '中国乡土菜研究协会', '中华新时代·智慧爱家庭教育联盟', '中国便秘联谊会', '韩国基督教“新天地教会”成都片区', '中国微电影联盟']

has_dissalvoe_illegal_organization = ['四川师范大学校友会', '中国便秘联谊会', '成都市金牛区物流行业协会', '华夏民办教育联盟', '中国乡土菜研究协会', '与爱同行家庭教育联盟', '全国学校体育联盟', '中华新世代智慧爱家庭教育联盟', '中国安全健康教育中心', '北京市卫民安消防教育中心四川分中心', '韩国基督教“新天地教会”成都片区', '中华糖尿病医学会', '川渝国学形派学术交流协会', '中国微电影联盟', '绵阳互联网联盟', '万源市乡村旅游协会', '“中国梦”万源市青花学习点志愿者协会', '宣汉县钓鱼运动协会', '中国中医药协会慢性病工程', '乐山市爱心车协会', '汶川县同心协会', '舞韵琴行', '天汇新课堂', '寰宇国际教育', '理县行善者公益组织', '理县新学堂', '中国摄影联合会攀枝花分会', '渠县马鞍山爱心养生堂', '渠县马鞍山玉芳老年公寓']

print(len(illegal_organization), len(has_public_illegal_organization), len(has_dissalvoe_illegal_organization), len(illegal_organization) + len(has_public_illegal_organization) + len(has_dissalvoe_illegal_organization))

all_set = set(illegal_organization).union(set(has_public_illegal_organization)).union(set(has_dissalvoe_illegal_organization))
print(all_set)
print(len(all_set))